public class DataType {
    public static void main(String [] args){
        //整數拓展  進制  二進制0b   十進制   八進制0  十六進制0x

        int i = 10;
        int i2 = 010; //八進制0
        int i3 = 0x10; //十六進制0x 0-9 A-F

        System.out.println(i);
        System.out.println(i2);
        System.out.println(i3);
        System.out.println("================================================================================================");
        //================================================================================================
        //浮點數拓展  銀行業務表示錢最好完全不使用浮點數，用BigDecimal 數學工具類
        //float  有限 離散 輸入誤差 大約 接近但不等於
        //double

        float f = 0.1f; //0.1
        double d = 1.0/10; //0.1

        System.out.println(f==d);//false

        float f2 = 232323232323f;
        float f3 = f2+1;

        System.out.println(f2==f3);
        System.out.println("================================================================================================");
        //================================================================================================
        //字符拓展

        char c1 = 'a';
        char c2 = '中';
        char c3 = '\u0061';
        System.out.println(c1);
        System.out.println((int)c1);//強制轉換
        System.out.println(c2);
        System.out.println((int)c2);//強制轉換
        System.out.println(c3);
        //文字本質是數字，設計至少是編碼。 Unicode

        System.out.println("================================================================================================");
        //================================================================================================
        //轉譯字符
        // \t 製表符
        // \n 換行

        System.out.println("================================================================================================");
        //================================================================================================


        int i4 = 128;
        byte b = (byte)i;

        System.out.println(b);
        /**
         * 1. 不能把布爾值進行轉換
         * 2. 不能把對象類型轉換為不相干的類型
         * 3. 高容量到低容量時強制轉換
         * 4. 轉換時可能存在內存溢出，精度問題
         */
    }
}
